## Topics
- Virtual environments
- numpy
- pandas

## Virtual Enviroment
### Purpose
- virtualenv is used to manage Python packages for different projects. 
- Using virtualenv allows you to avoid installing Python packages globally which could break system tools or other projects.

### Setup
1. Create virtual environment
```bash
python3 -m venv env
```
2. Activate virtual enviroment
```bash
source env/bin/activate
```
3. Confirm environment
```bash
which python3
```
4. Deactivate
```bash
deactivate
```

## Pandas
- Common methods
    1. read_csv
    2. head
    3. tail
    4. shape
- Terminologies
    - Dataframe vs Series

## Creating our own DataFrame

In [1]:
import pandas as pd
people = {
    "first": ['Corey', 'Jane', 'John'],
    "last": ['Schafer', 'Doe', 'Doe'],
    'email': ["CoreyMSchafer@gmail.com", 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

df = pd.DataFrame(people)
df

ModuleNotFoundError: No module named 'pandas'

## Reading files using Pandas

In [5]:
import pandas as pd
p_df = pd.read_csv('./practical-python/Work/Data/prices.csv', header=None)
portfolio_df = pd.read_csv('./practical-python/Work/Data/portfolio.csv')
portfolio_df
# p_df

   name  shares  price
0    AA     100  32.20
1   IBM      50  91.10
2   CAT     150  83.44
3  MSFT     200  51.23
4    GE      95  40.37
5  MSFT      50  65.10
6   IBM     100  70.44

In [160]:
type(portfolio_df.name)

pandas.core.series.Series

## Accessing Rows and Columns

In [18]:
# portfolio_df['name']
# portfolio_df.name

# portfolio_df[['name', 'price']]
# portfolio_df.columns

# Accessing rows using iloc (integer location)
# portfolio_df.iloc[2:6, [0,1]]
# df.iloc[[0, 2]]
# portfolio_df.iloc[[0, 2], 0]
# portfolio_df.iloc[0:2, 0] # exclusive
portfolio_df.loc[[0,1], ['name', 'price']]
# portfolio_df.loc[[0,1], 'name':'price'] # inclusive

  name  price
0   AA   32.2
1  IBM   91.1

## <span style="color:skyblue">Exercise</span>
- Find out what hobbyist means

## Setting a different index

In [29]:
# portfolio_df.set_index('name', inplace=True) # does not replace original df
# portfolio_df.set_index('name', inplace=True)
# portfolio_df
# portfolio_df.reset_index(inplace=True) # reset back to original

# instead of setting the index after loading the file, it is more common to do it when you load the file
# portfolio_df = pd.read_csv('./practical-python/Work/Data/portfolio.csv', index_col="name")
# portfolio_df.loc['MSFT']

      shares  price
name
MSFT     200  51.23
MSFT      50  65.10

## Sorting by Index

In [35]:
# portfolio_df.sort_index(ascending=False, inplace=True) # default for ascending is True
# portfolio_df

      shares  price
name
MSFT     200  51.23
MSFT      50  65.10
IBM       50  91.10
IBM      100  70.44
GE        95  40.37
CAT      150  83.44
AA       100  32.20

## Filtering Data
- Common filter methods
    1. isin
    2. contains

In [38]:
filt = (portfolio_df.price > 60) # create a filter first. this returns a series, not a df
portfolio_df.loc[filt, ['price']]
# portfolio_df.loc[filt, ['name', 'price']] # better method to do the same thing with more functionality
# portfolio_df.loc[~filt, ['name', 'price']] # opposite filter

# stocks = ["MSFT", "GE", "IBM"]

# filt = portfolio_df.name.isin(stocks)
# portfolio_df[filt]

# filt = portfolio_df.name.str.contains("T", na=False) # na is a way to handle cells with no values
# portfolio_df[filt]

      price
name
MSFT  65.10
IBM   91.10
IBM   70.44
CAT   83.44

## <span style="color:skyblue">Exercise</span>
- Filter the data to show ConvertedComp above $70,000.
- Display the following columns: Country, LanguageWorkedWith, and ConvertedComp

## Modifying Data in Dataframes

### Modifying columns

In [165]:
# Modifying all the column names
portfolio_df.columns = ['stock name', 'number of shares', 'price']
portfolio_df.columns = [x.upper() for x in portfolio_df.columns] # make all columns upper case
portfolio_df.columns = portfolio_df.columns.str.replace(" ", "_")
portfolio_df

# Modify some columns
portfolio_df.rename(columns={'STOCK_NAME': 'chicken'}, inplace=True) # change doesnt persist

### Modifying Rows

In [166]:
portfolio_df.loc[2] = ["AAPL", 50, "999"] # changes entire row

portfolio_df.loc[2, ['chicken', 'PRICE']] = ['GOOG', 599] # modifying row of selected column

# Common pitfall!!! Do not chain index when setting values! Use loc/iloc instead
filt = portfolio_df['PRICE'] > 299
# portfolio_df[filt]['PRICE'] = 1000 # WRONG!

portfolio_df.loc[filt, 'PRICE'] = 1000 # CORRECT!

# change all rows of a specific column
portfolio_df['chicken'] = portfolio_df['chicken'].str.lower()

portfolio_df

  chicken  NUMBER_OF_SHARES  PRICE
6     ibm               100  70.44
5    msft                50   65.1
4      ge                95  40.37
3    msft               200  51.23
2    goog                50   1000
1     ibm                50   91.1
0      aa               100   32.2

#### apply, map, applymap and replace

##### Apply

In [167]:
# apply on a Series
def custom_add(x):
    if x < 180:
        return x + 100
    else:
        return x - 1000
# when using apply on a Series, it allows us to apply some custom function to all rows
portfolio_df['chicken'].apply(len)
portfolio_df['PRICE'].apply(custom_add)

# apply on a DataFrame: applies the function to every Series in the DF
portfolio_df.apply(len)
portfolio_df.apply(len, axis="columns")

6    3
5    3
4    3
3    3
2    3
1    3
0    3
dtype: int64

##### Apply Map
- Only works on Dataframes
- applies a function to every single cell

In [168]:
portfolio_df.applymap(lambda x : str(x) + "1")

  chicken NUMBER_OF_SHARES   PRICE
6    ibm1             1001  70.441
5   msft1              501   65.11
4     ge1              951  40.371
3   msft1             2001  51.231
2   goog1              501   10001
1    ibm1              501   91.11
0     aa1             1001   32.21

##### Map
- Only works on Series

In [169]:
portfolio_df.chicken.map({"aa": "bb", "msft": "booo"}) # replaces values but other values become NaN

6     NaN
5    booo
4     NaN
3    booo
2     NaN
1     NaN
0      bb
Name: chicken, dtype: object

##### Replace

In [170]:
portfolio_df.chicken.replace({"aa": "bb", "msft": "booo"})

6     ibm
5    booo
4      ge
3    booo
2    goog
1     ibm
0      bb
Name: chicken, dtype: object

## <span style="color:skyblue">Exercise</span>
- Rename ConvertedComp column name to SalaryUSD
- Change all Yes and No in the Hobbyist column to True and False respectively

## Add/Remove Rows and Columns

### Adding Columns

In [9]:
# total_value = portfolio_df['NUMBER_OF_SHARES'] * portfolio_df["PRICE"]
# portfolio_df['total_value'] = total_value
# portfolio_df.chicken = total_value
portfolio_df['chicken'] = pd.Series([1,2,3])
portfolio_df

   name  shares  price  chicken
0    AA     100  32.20      1.0
1   IBM      50  91.10      2.0
2   CAT     150  83.44      3.0
3  MSFT     200  51.23      NaN
4    GE      95  40.37      NaN
5  MSFT      50  65.10      NaN
6   IBM     100  70.44      NaN

### Removing Columns

In [190]:
portfolio_df.drop(columns=['chicken'])
df.drop(columns=["first", 'last'], inplace=True)

### Splitting a single column into 2 columns

In [199]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

### Adding Rows

In [215]:
df = pd.concat([df, pd.DataFrame.from_records([{ 'first': 'Tony'}])])
# df = pd.concat([df, pd.DataFrame.from_dict({ 'index': 7 ,'first': 'Tony'})])
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
0   Tony      NaN                      NaN

### Joining 2 Dataframes

In [3]:
people = {
    "first": ['Tony', 'Bob'],
    "last": ['Ong', 'Tan'],
    'email': ["TonyOng@gmail.com", 'BobTan@gmail.com']
}

df2 = pd.DataFrame(people)
pd.DataFrame(df2)

  first last              email
0  Tony  Ong  TonyOng@gmail.com
1   Bob  Tan   BobTan@gmail.com

In [220]:
pd.concat([df, df2], ignore_index=True) # ignore index is important else there will be rows with duplicate index

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com
3   Tony      NaN                      NaN
4   Tony      Ong        TonyOng@gmail.com
5    Bob      Tan         BobTan@gmail.com

### Removing Rows

In [234]:
# simple case
df.drop(index=0)

# more complex case: removing all rows whose last name is Doe
df.drop(index=df[df['last'] == 'Doe'].index)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
0   Tony      NaN                      NaN